## Lab 3: Data Wrangling (5 points)

### save all outputs in a .html file. Submit that .html file to Canvas.

### 1. Merging (1 pt)

In [2]:
import pandas as pd

df3 = pd.DataFrame({
    "lkey": ["b", "b", "a", "c", "a", "a", "b"],
    "data1": pd.Series(range(7), dtype="Int64")
})

df4 = pd.DataFrame({
    "rkey": ["a", "b", "d"],
    "data2": pd.Series(range(3), dtype="Int64")
})
display(df3)
display(df4)

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

  rkey  data2
0    a      0
1    b      1
2    d      2

a) Merge df3 and df4 by showing only the rows with matching keys.

In [10]:
merged_df = pd.merge(df3, df4, left_on="lkey", right_on="rkey", how="inner")
display(merged_df)

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

Question: Which keys appear in the result? Why?

Answer:

b) Merge but keep all rows from both DataFrames.

In [8]:
all_merged_df = pd.merge(df3, df4, left_on="lkey", right_on="rkey", how="outer")
display(all_merged_df)

  lkey  data1 rkey  data2
0    a      2    a      0
1    a      4    a      0
2    a      5    a      0
3    b      0    b      1
4    b      1    b      1
5    b      6    b      1
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

Question:
What does NaN/<NA> mean in the output?

Answer:

### 2. Concatenation (1 pt)

In [11]:
import pandas as pd

s1 = pd.Series([0, 1], index=["a", "b"], dtype="Int64")
s2 = pd.Series([2, 3, 4], index=["b", "c", "d"], dtype="Int64")
display(s1); display(s2)

a    0
b    1
dtype: Int64

b    2
c    3
d    4
dtype: Int64

a) Concatenate along rows.

In [14]:
pd.concat([s1,s2])

a    0
b    1
b    2
c    3
d    4
dtype: Int64

Question:
	1.	What happens to the indices?
	2.	Are there duplicate index labels? Why?

Answer:

b) Concatenate along columns

In [15]:
pd.concat([s1,s2], axis="columns")

      0     1
a     0  <NA>
b     1     2
c  <NA>     3
d  <NA>     4

c) Concatenate along columns, but don't include rows with NAs in the result

In [16]:
pd.concat([s1,s2], axis="columns", join="inner")

   0  1
b  1  2

### 3. combine_first (3 points)

In [17]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({
    "a": [1., np.nan, 5., np.nan],
    "b": [np.nan, 2., np.nan, 6.],
    "c": range(2, 18, 4)
})

df2 = pd.DataFrame({
    "a": [5., 4., np.nan, 3., 7.],
    "b": [np.nan, 3., 4., 6., 8.]
})
display(df1); display(df2)

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

a) 
When executing:

df1.combine_first(df2)

What happens when both DataFrames have overlapping rows (exactly the same indices)?
- a) Rows from df2 replace those from df1.
- b) Missing values in df1 are filled from df2 (aligned by index).
- c) Missing values in df2 are filled from df1.
- d) Both DataFrames are stacked vertically.

Your answer and explanation:

b) 
When executing:

df1.combine_first(df2)

What will be the number of rows in the resulting DataFrame?
- a) 4
- b) 5
- c) 9
- d) Depends on the how parameter

(Hint: df1 has indices [0,1,2,3] and df2 has [0,1,2,3,4].)

Your answer and explanation:

c) 
When executing:

df1.combine_first(df2)

Which columns appear in the result?
- a) Only columns shared by both (a, b)
- b) Only columns from df1
- c) All columns from both (a, b, c)
- d) Columns from df2 overwrite df1


Your answer and explanation: